/* No comment provided by engineer. */
"Authenticating as {0}" = "Autentimine kui {0}";
"Calculate checksum for {0}" = "Arvuta {0} kontrollsumma";

"Deleting {0}" = "Kustutamine {0}";
"Disconnected" = "Lahti ühendatud";
"Disconnecting {0}" = "Ühenduse katkestamine {0}";
"Downloading {0}" = "Alla laadimine {0}";
/* Connection type opened */
"{0} connection opened" = "{0} ühendus avatud";

/* Reading size of file. */
"Getting size of {0}" = "{0} suuruse hankimine";

/* Reading modification date of file. */
"Getting timestamp of {0}" = "{0} ajatempli hankimine";

/* Reading permission of file. */
"Getting permission of {0}" = "{0} õiguste hankimine";

/* No activity */
"Idle" = "Jõude";
"Listing directory {0}" = "{0} kausta lugemine";
"Making directory {0}" = "Kausta {0} loomine";
"Maximum allowed connections exceeded. Waiting" = "Maksimaalne ühenduste arv on ületatud. Ootel...";
"Mounting {0}" = "Ühendamine {0}";

/* The user did not accept the certificate or is not valid */
"No trusted certificate found" = "Usaldusväärset sertifikaati ei leitud";
"Opening {0} connection to {1}" = "Opening {0} connection to {1}";
"SFTP subsystem ready" = "SFTP alamsüsteem on valmis";
"SCP subsystem ready" = "SCP alamsüsteem on valmis";
"Starting SFTP subsystem" = "SFTP alamsüsteemi käivitamine";
"Starting SCP subsystem" = "SCP alamsüsteemi käivitamine";
"Uploading {0}" = "Üles laadimine {0}";

/* Renaming file status message; Renaming to <new filename>. */
"Renaming {0} to {1}" = "Renaming {0} to {1}";

/* Duplicate a file */
"Copying {0} to {1}" = "Copying {0} to {1}";

/* Changing the owner of a file */
"Changing owner of {0} to {1}" = "Changing owner of {0} to {1}";

/* Changing the group owner of a file */
"Changing group of {0} to {1}" = "Changing group of {0} to {1}";

/* Changing UNIX file permissions */
"Changing permission of {0} to {1}" = "Changing permission of {0} to {1}";

/* Indicates remaining time needed for files to transfer */
"{0} seconds remaining" = "{0} sekundit veel";

/* Indicates remaining time needed for files to transfer */
"{0} minutes remaining" = "{0} minutit veel";

/* Indicates remaining time needed for files to transfer */
"{0} hours remaining" = "{0} tundi veel";

/* When trying to determine the IP address of a server hostname; e.g. Resolving example.net */
"Resolving {0}" = "{0} lahendamine";

/* Retry in 10 seconds - Used to indicate the time left until another connection attempt is made */
"Retry again in {0} seconds ({1} more attempts)" = "Retry again in {0} seconds ({1} more attempts)";
"Transfer complete" = "Ülekanne on valmis";
"Transfer incomplete" = "Ülekanne pole lõpetatud";

/* Content distribution network (CDN) */
"Enable {0} Distribution" = "Enable {0} Distribution";
"Disable {0} Distribution" = "Disable {0} Distribution";

/* Compress and expand archives */
"Archiving {0}" = "{0} pakkimine";
"Unarchiving {0}" = "{0} lahtipakkimine";

/* Compute MD5 hash */
"Compute MD5 hash of {0}" = "Arvuta {0} MD5 kontrollsumma";

/* Reading HTTP headers */
"Reading metadata of {0}" = "{0} metaandmete lugemine";

/* Writing custom HTTP headers */
"Writing metadata of {0}" = "{0} metaandmete kirjtuamine";

/* Prepare path for transfer */
"Prepare {0} ({1})" = "Valmista {0} ({1})";

/* Content distribution network (CDN) configuration */
"Reading CDN configuration of {0}" = "{0} CDN seadistuste lugemine";
"Writing CDN configuration of {0}" = "{0} CDN seadistuste kirjutamine";

/* Growl Notification */
"Connection failed" = "Ühendumine ebaõnnestus";

/* Growl Notification */
"Connection opened" = "Ühendus on avatud";

/* Growl Notification */
"Download complete" = "Allalaadimine on valmis";

/* Growl Notification */
"Synchronization complete" = "Sünkroonimine on valmis";

/* Growl Notification */
"Upload complete" = "Üleslaadimine on valmis";

/* Growl Notification */
"Download failed" = "Allalaadimine ebaõnnestus";

/* Growl Notification */
"Upload failed" = "Üleslaadimine ebaõnnestus";

/* Growl Notification */
"Transfer queued" = "Ülekanne on pandud järjekorda";
